# OnlyMonolithicStairs Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..OnlyMonolithicStairs Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Tread thickness can't be zero for non-monolithic stairs
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OnlyMonolithicStairs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OnlyMonolithicStairs As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OnlyMonolithicStairs {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace